app/controllers/movies_controller.rb

SELECT `movies`.* FROM `movies`
---
  def index
    @movies = Movie.all

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`movie_id` = 1  ORDER BY created_at DESC
---
  def show
    @reviews = Review.where(movie_id: @movie.id).order("created_at DESC")

INSERT INTO `movies` (`title`, `description`, `movie_length`, `director`, `rating`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `user_id`, `created_at`, `updated_at`) VALUES ('The Avengers', 'Awesome movie', '1:23', 'Lorenzo Zed', 'PG 10', '585f0002bb4f829d351ce13815e1885e.jpg', 'image/jpeg', 56340, '2016-06-29 11:10:44', 1, '2016-06-29 11:10:44', '2016-06-29 11:10:44')
---
  def create
    @movie = current_user.movies.build(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE `movies` SET `image_file_name` = 'large_zJ2eK7fehqFSQ2w5JlQIF0OJP9q.jpg', `image_content_type` = 'image/jpeg', `image_file_size` = 109981, `image_updated_at` = '2016-06-29 10:50:38', `updated_at` = '2016-06-29 10:50:39' WHERE `movies`.`id` = 3
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)

SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 3 LIMIT 1
---
    def set_movie
      @movie = Movie.find(params[:id])