app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.username = current_user.username
    @review.movie_id = @movie.id

    respond_to do |format|
      if @review.save
---
INSERT INTO `reviews` (`rating`, `comment`, `user_id`, `username`, `movie_id`, `created_at`, `updated_at`) VALUES (5, 'Awesome!', 1, 'lorenzozanotto', 1, '2016-06-29 12:50:23', '2016-06-29 12:50:23')

  def destroy
    @review.destroy
---
DELETE FROM `reviews` WHERE `reviews`.`id` = 1

    def set_review
      @review = Review.find(params[:id])
---
SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 1 LIMIT 1

    def set_movie
      @movie = Movie.find(params[:movie_id])
---
SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1